Tekla Open API Reference for Tekla Structures 2025
ReportTemplateElement.Clone Method
 Clones the object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override Object Clone()
Public Overrides Function Clone As Object
Return Value
Type: Object
A copy of the object.
Implements
ICloneable.Clone()
See Also
Reference
ReportTemplateElement Class
Tekla.Structures.Drawing Namespace